#### SiteSubRegion Members

---

|  |
| --- |
| SiteSubRegion Class   Methods   Properties   See Also |

The  SiteSubRegion  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, IList CurveLoop ) | Creates a new SiteSubRegion element and adds it to the document. |
| Public method Static member | Create(Document, IList CurveLoop , ElementId) | Creates a new SiteSubRegion element with assigned TopographySurface to be hosted and adds it to the document. |
| Public method | Dispose | Releases all resources used by the  SiteSubRegion |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetBoundary | Gets the boundary of current subregion. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method Static member | IsValidBoundary | Identifies whether the given curve loops compose a valid boundary. |
| Public method | SetBoundary | Set the given curve loops as the boundary of an existing SiteSubRegion. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | HostId | The element id of the topography surface hosting this SiteSubRegion. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | TopographySurface | The TopographySurface element which this SiteSubRegion represents. |

# See Also

SiteSubRegion Class

Autodesk.Revit.DB.Architecture Namespace